storage/tests/a4595a0a-5a76-4de0-bbd2-8c058fcd1005/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/a4595a0a-5a76-4de0-bbd2-8c058fcd1005/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  00.9s/30s

running (0m01.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  01.9s/30s

running (0m02.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  02.9s/30s

running (0m03.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  03.9s/30s

running (0m04.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  04.9s/30s

running (0m05.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  05.9s/30s

running (0m06.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  06.9s/30s

running (0m07.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  07.9s/30s

running (0m08.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  08.9s/30s

running (0m09.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  09.9s/30s

running (0m10.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  10.9s/30s

running (0m11.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  11.9s/30s

running (0m12.9s), 1000/1000 VUs, 3 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  12.9s/30s

running (0m13.9s), 1000/1000 VUs, 4 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  13.9s/30s

running (0m14.9s), 1000/1000 VUs, 15 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  14.9s/30s

running (0m15.9s), 1000/1000 VUs, 25 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  15.9s/30s

running (0m16.9s), 1000/1000 VUs, 39 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  16.9s/30s

running (0m17.9s), 1000/1000 VUs, 59 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  17.9s/30s

running (0m18.9s), 1000/1000 VUs, 91 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  18.9s/30s

running (0m19.9s), 1000/1000 VUs, 120 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  19.9s/30s

running (0m20.9s), 1000/1000 VUs, 154 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  20.9s/30s

running (0m21.9s), 1000/1000 VUs, 197 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  21.9s/30s

running (0m22.9s), 1000/1000 VUs, 251 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  22.9s/30s

running (0m23.9s), 1000/1000 VUs, 295 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  23.9s/30s

running (0m24.9s), 1000/1000 VUs, 331 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  24.9s/30s

running (0m25.9s), 1000/1000 VUs, 377 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  25.9s/30s

running (0m26.9s), 1000/1000 VUs, 409 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  26.9s/30s

running (0m27.9s), 1000/1000 VUs, 444 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  27.9s/30s

running (0m28.9s), 1000/1000 VUs, 483 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  28.9s/30s

running (0m29.9s), 1000/1000 VUs, 526 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  29.9s/30s

running (0m30.9s), 0954/1000 VUs, 577 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m31.9s), 0903/1000 VUs, 628 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m32.9s), 0869/1000 VUs, 662 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m33.9s), 0821/1000 VUs, 710 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m34.9s), 0778/1000 VUs, 753 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m35.9s), 0732/1000 VUs, 799 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m36.9s), 0682/1000 VUs, 849 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m37.9s), 0620/1000 VUs, 911 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m38.9s), 0567/1000 VUs, 964 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m39.9s), 0539/1000 VUs, 992 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m40.9s), 0527/1000 VUs, 1004 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m41.9s), 0519/1000 VUs, 1012 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m42.9s), 0507/1000 VUs, 1024 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m43.9s), 0491/1000 VUs, 1040 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m44.9s), 0471/1000 VUs, 1060 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m45.9s), 0437/1000 VUs, 1094 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m46.9s), 0408/1000 VUs, 1123 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m47.9s), 0371/1000 VUs, 1160 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m48.9s), 0336/1000 VUs, 1195 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m49.9s), 0307/1000 VUs, 1224 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m50.9s), 0273/1000 VUs, 1258 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m51.9s), 0232/1000 VUs, 1299 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m52.9s), 0194/1000 VUs, 1337 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m53.9s), 0153/1000 VUs, 1378 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m54.9s), 0117/1000 VUs, 1414 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m55.9s), 0085/1000 VUs, 1446 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m56.9s), 0069/1000 VUs, 1462 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m57.9s), 0052/1000 VUs, 1479 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m58.9s), 0029/1000 VUs, 1502 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s

running (0m59.9s), 0014/1000 VUs, 1517 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......: 14523  242.044212/s
    checks_succeeded...: 62.65% 9100 out of 14523
    checks_failed......: 37.34% 5423 out of 14523

    ✗ status ok
      ↳  62% — ✓ 9100 / ✗ 5423

    HTTP
    http_req_duration..............: avg=777.18ms min=99.4µs   med=148.26ms max=15.87s p(90)=2.35s  p(95)=2.61s 
      { expected_response:true }...: avg=807.59ms min=136.28µs med=201.18ms max=15.28s p(90)=2.39s  p(95)=2.66s 
    http_req_failed................: 37.34% 5423 out of 14523
    http_reqs......................: 14523  242.044212/s

    EXECUTION
    iteration_duration.............: avg=28.3s    min=11.95s   med=28.32s   max=41.63s p(90)=37.08s p(95)=38.21s
    iterations.....................: 1519   25.316061/s
    vus............................: 14     min=14            max=1000
    vus_max........................: 1000   min=1000          max=1000

    NETWORK
    data_received..................: 104 MB 1.7 MB/s
    data_sent......................: 1.3 MB 21 kB/s



running (1m00.0s), 0000/1000 VUs, 1519 complete and 12 interrupted iterations
default ✓ [ 100% ] 1000 VUs  30s